I have exactly same issue (with 4.11.0 as well as with 4.12.0) Any update on this @duytiennguyen-okta? I can provide more information if needed...

This happens when trying to create okta_app_saml and ALSO when trying to import it (it seems READ fails).
My TF causing this looks like this:


`# okta_app_saml.this will be created
  + resource "okta_app_saml" "this" {
      + accessibility_self_service  = false
      + app_settings_json           = jsonencode(
            {
              + subDomain = "my-subdomain"
            }
        )
      + authentication_policy       = (known after apply)
      + auto_submit_toolbar         = false
      + certificate                 = (known after apply)
      + embed_url                   = (known after apply)
      + entity_key                  = (known after apply)
      + entity_url                  = (known after apply)
      + features                    = (known after apply)
      + hide_ios                    = true
      + hide_web                    = true
      + honor_force_authn           = false
      + http_post_binding           = (known after apply)
      + http_redirect_binding       = (known after apply)
      + id                          = (known after apply)
      + key_id                      = (known after apply)
      + keys                        = (known after apply)
      + label                       = "dovetail"
      + logo_url                    = (known after apply)
      + metadata                    = (known after apply)
      + metadata_url                = (known after apply)
      + name                        = (known after apply)
      + preconfigured_app           = "dovetail"
      + saml_signed_request_enabled = false
      + saml_version                = "2.0"
      + sign_on_mode                = (known after apply)
      + status                      = "ACTIVE"
      + user_name_template          = "${source.login}"
      + user_name_template_type     = "BUILT_IN"
    }`
